ticepd/StarShipXP-energia/StarShipPinMap_MSP430.h
#include <Energia.h>

#define LED_R P1_5
#define LED_G P1_3
#define LED_B P1_4

#define LDR_NTC P6_6
#define POT P6_5

#define NAVIKEYS P6_4

#define MIC_IN P7_0

#define AUDIO_IN_L P6_2
#define AUDIO_IN_R P6_3

#define I2C_SCL P4_2
#define I2C_SDA P4_1

#define AUDIO_OUT_L P2_5
#define AUDIO_OUT_R P2_4

#define BUZZER P2_5

#define SPI_MOSI P3_0
#define SPI_MISO P3_1
#define SPI_CLK P3_2
#define SPI_CS_A P2_3
#define SPI_CS_B P8_1

#define DHT_IN P2_0

#define LCD_D4 P1_6
#define LCD_D5 P2_7
#define LCD_D6 P3_6
#define LCD_D7 P1_2
#define LCD_EN P2_2
#define LCD_RS P3_5

#define KEYPAD_OUT1 P1_6
#define KEYPAD_OUT2 P2_7
#define KEYPAD_OUT3 P3_6
#define KEYPAD_OUT4 P1_2
#define KEYPAD_IN1 P4_3
#define KEYPAD_IN2 P4_0
#define KEYPAD_IN3 P3_7
#define KEYPAD_IN4 P8_2

#define GLCD_RESET P3_1
#define GLCD_DC P2_6
#define GLCD_SCK P3_2

#define BT_KEY P7_4
#define UART_TX P3_3
#define UART_RX P3_4